PDrzymkowski/STM32F746G-DISCO_Guitar_Multieffect_HAL/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ************************************************************************************
  * @file           : main.h
  * @brief         : Plik naglowkowy pliku main.c
  *  Zawiera makro, pliki naglowkowe oraz prototypy funkcji pliku main.c
  ************************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_sdram.h"
#include "stm32746g_discovery_ts.h"
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_audio.h"
#include "stm32746g_discovery_sd.h"

#include <stdio.h>
#include "math.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
/**
*  Stan efektu: wlaczony/wylaczony
  */
typedef enum
{
	ACTIVE = 0,
	NOT_ACTIVE = 1,
	
}IS_EFFECT_ACTIVE_StateTypeDef;

/**
  *  Stan przyciskow panelu dotykowego
  */
typedef enum
{
	BUTTON_ACTIVE = 0,
	BUTTON_NOT_ACTIVE = 1,
}IS_BUTTON_ACTIVE_StateTypeDef;

/**
  *  Typ filtra dla efektow
  */
typedef enum
{
	SOI = 0,
	NOI = 1,
}FILTER_VERSION_StateTypeDef;


/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void Display_MainWindow(void);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_0
#define LED_GPIO_Port GPIOI
/* USER CODE BEGIN Private defines */

#define RGB565_BYTE_PER_PIXEL     2
#define ARBG8888_BYTE_PER_PIXEL   4

/* Rozdzielczosc ekranu wyswietlacza LCD */
#define CAMERA_RES_MAX_X          640
#define CAMERA_RES_MAX_Y          480


/* Rozmiary bloku danych, bufora probek oraz adresu bufora */
#define AUDIO_BLOCK_SIZE   ((uint32_t)256)
#define AUDIO_BUFFER_SIZE ((uint32_t)45056)
#define AUDIO_BUFFER_IN    AUDIO_REC_START_ADDR     /* In SDRAM */
#define AUDIO_BUFFER_OUT   (AUDIO_REC_START_ADDR + (AUDIO_BLOCK_SIZE * 2)) /* In SDRAM */

/* Kod karty SD znajdujacy sie na pcozatku bloku danych, definiuje poprawnosc i kompletnosc parametrow efektow zapisanych na karcie */
#define SD_CODE											9876


#define BLOCK_START_ADDR         0     /* Startowy blok pamieci */
#define NUM_OF_BLOCKS            1     /* Calkowita liczba blokow danych audio   */
#define BUFFER_WORDS_SIZE        (BLOCKSIZE * NUM_OF_BLOCKS) /* Calkowity rozmiar danych audio w bajtach */

/**
  * @brief  LCD FB_StartAddress
  * LCD Frame buffer start address : starts at beginning of SDRAM
  */
#define LCD_FRAME_BUFFER          SDRAM_DEVICE_ADDR

/**
  * @brief  Camera frame buffer start address
  * Assuming LCD frame buffer is of size 480x800 and format ARGB8888 (32 bits per pixel).
  */
#define CAMERA_FRAME_BUFFER       ((uint32_t)(LCD_FRAME_BUFFER + (RK043FN48H_WIDTH * RK043FN48H_HEIGHT * ARBG8888_BYTE_PER_PIXEL)))

/**
  * @brief  SDRAM Write read buffer start address after CAM Frame buffer
  * Assuming Camera frame buffer is of size 640x480 and format RGB565 (16 bits per pixel).
  */
#define SDRAM_WRITE_READ_ADDR        ((uint32_t)(CAMERA_FRAME_BUFFER + (CAMERA_RES_MAX_X * CAMERA_RES_MAX_Y * RGB565_BYTE_PER_PIXEL)))

#define SDRAM_WRITE_READ_ADDR_OFFSET ((uint32_t)0x0800)
#define SRAM_WRITE_READ_ADDR_OFFSET  SDRAM_WRITE_READ_ADDR_OFFSET

#define AUDIO_REC_START_ADDR         SDRAM_WRITE_READ_ADDR


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
